In [1]:
# Standard Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
# Additional Imports
import os, json, math, time

from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote
from sqlalchemy.types import *

In [2]:
username = 'root' # default username for MySQL db is root
password = 'Rocp137a7bc' # whatever password you chose during MySQL installation.

connection = f'mysql+pymysql://{username}:{password}@localhost/moviesP3'
engine = create_engine(connection)

In [3]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [4]:
## Loading Dataframe
df_basics = pd.read_csv("Data/basics.cvs.gz")
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [5]:
## Loading Dataframe
df_akas = pd.read_csv("Data/akas.cvs.gz")
df_akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [6]:
## Loading Dataframe
df_ratings = pd.read_csv("Data/ratings.cvs.gz")
df_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1965
1  tt0000002            5.8       262
2  tt0000005            6.2      2603
3  tt0000006            5.1       179
4  tt0000007            5.4       816

In [7]:
df_tmdb = pd.read_csv("Data/TMDB_MERGED.cvs.gz")
df_tmdb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2556 entries, 0 to 2555
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2556 non-null   object
 1   adult                  2554 non-null   float64
 2   backdrop_path          1380 non-null   object
 3   belongs_to_collection  204 non-null    object
 4   budget                 2554 non-null   float64
 5   genres                 2554 non-null   object
 6   homepage               172 non-null    object
 7   id                     2554 non-null   float64
 8   original_language      2554 non-null   object
 9   original_title         2554 non-null   object
 10  overview               2502 non-null   object
 11  popularity             2554 non-null   float64
 12  poster_path            2297 non-null   object
 13  production_companies   2554 non-null   object
 14  production_countries   2554 non-null   object
 15  release_date           2537 non-null   object
 16  revenue                2554 non-null   float64
 17  runtime                2554 non-null   float64
 18  spoken_languages       2554 non-null   object
 19  status                 2554 non-null   object
 20  tagline                1093 non-null   object
 21  title                  2554 non-null   object
 22  video                  2554 non-null   float64
 23  vote_average           2554 non-null   float64
 24  vote_count             2554 non-null   float64
 25  certifcation           811 non-null    object
dtypes: float64(9), object(17)
memory usage: 519.3+ KB

In [8]:
## Dropping unneeded columns
df_tmdb_filtered = df_tmdb[["imdb_id", "revenue", "budget", "certifcation"]].copy()
df_tmdb_filtered.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2556 entries, 0 to 2555
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   imdb_id       2556 non-null   object
 1   revenue       2554 non-null   float64
 2   budget        2554 non-null   float64
 3   certifcation  811 non-null    object
dtypes: float64(2), object(2)
memory usage: 80.0+ KB

## Creating Title Basics Table
---

In [9]:
## Splitting genres
df_basics["genres_split"] = df_basics["genres"].str.split(",")

## exploding split column
exploded_genres = df_basics.explode("genres_split")

unique_genres = sorted(exploded_genres["genres_split"].unique())

In [10]:
## Creating new titles tables
title_genres = exploded_genres[["tconst", "genres_split"]].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [11]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [12]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns = "genres_split")

In [13]:
genre_lookup = pd.DataFrame({"Genre_name" : genre_map.keys(), "Genre_ID" : genre_map.values()})
genre_lookup.head()

  Genre_name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [14]:
## Dropping unneeded columns
df_basics = df_basics.drop(columns = ['originalTitle', 'genres_split', 'isAdult', 'titleType', 'genres'])

In [15]:
df_basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70
2,tt0069049,The Other Side of the Wind,2018.0,NaN,122
3,tt0088751,The Naked Monster,2005.0,NaN,100
4,tt0096056,Crime and Punishment,2002.0,NaN,126

In [16]:
key_len = df_basics['tconst'].fillna('').map(len).max()
title_len = df_basics['primaryTitle'].fillna('').map(len).max()
genre_name_len = genre_lookup['Genre_name'].fillna('').map(len).max()
certification_len = df_tmdb['certifcation'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    'tconst': String(key_len+1), 'primaryTitle': Text(title_len+1),
    'start_year': Float(), 'runtime_minutes': Integer(),
    'average_rating': Float(), 'num_votes': Integer(),
    'genre_id': Integer(), 'Genre_Name': Text(genre_name_len+1),
    'imdb_id': String(key_len+1), 'revenue': Float(),
    'budget': Float(), 'certification': Text(certification_len+1)
}

In [17]:
# Save to sql with dtype and index=False
df_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

86335

In [18]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

## Creating Title Ratings Table
---

In [19]:
df_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1965
1  tt0000002            5.8       262
2  tt0000005            6.2      2603
3  tt0000006            5.1       179
4  tt0000007            5.4       816

In [20]:
df_ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [21]:
## Creating scheme for df_ratings
key_len = df_ratings['tconst'].fillna('').map(len).max()

df_schema = {
    "tconst" : String(key_len+1),
    "averageRating" :Float(),
    "numVotes" : Integer()}

In [22]:
# Save to sql with dtype and index=False
df_ratings.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)

495159

In [23]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

## Creating TMDB Data Table
---

In [33]:
tmdb_filter = df_tmdb_filtered["imdb_id"] != "0"
df_tmdb_filtered = df_tmdb_filtered.loc[tmdb_filter, :]

In [34]:
## Creating scheme for TMDB table
key_len = df_tmdb_filtered['imdb_id'].fillna('').map(len).max()
certifcation_len = df_tmdb_filtered['certifcation'].fillna('').map(len).max()
df_schema = {
    "imdb_id" : String(key_len+1),
    "revenue" :Float(),
    "budget" : Float(),
    "certifcation" : String(certifcation_len+1)
}

In [35]:
# Save to sql with dtype and index=False
df_tmdb_filtered.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

2554

In [36]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

## Creating Title Genres Table
---

In [ ]:
title_genres.info()

In [ ]:
## Creating scheme for df_ratings
key_len = title_genres['tconst'].fillna('').map(len).max()

df_schema = {
    "tconst" : String(key_len+1),
    "genre_id" :Integer(),
}

In [ ]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)

## Creating Genres Table
---

In [ ]:
genre_lookup.info()

In [ ]:
## Creating scheme for df_ratings
key_len = genre_lookup['Genre_name'].fillna('').map(len).max()

df_schema = {
    "Genre_name" : Text(key_len+1),
    "Genre_ID" :Integer(),
}

In [ ]:
# Save to sql with dtype and index=False
genre_lookup.to_sql('genres',engine,dtype=df_schema,if_exists='replace',index=False)